# SetHalftone Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..SetHalftone Method
OverrideGraphicSettings Class See Also
---
Sets the halftone value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public OverrideGraphicSettings SetHalftone(
	bool halftone
)
```

Visual Basic
---
```text
Public Function SetHalftone ( _
	halftone As Boolean _
) As OverrideGraphicSettings
```

Visual C++
---
```text
public:
OverrideGraphicSettings^ SetHalftone(
	bool halftone
)
```

# ### Parameters
halftone
    Type: System..::..Boolean True if the override displays in halftone, false otherwise.
# ### Return Value
Reference to the changed object.
# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace